//Урок № 1 Задание № 1

// Tf температура по Фаренгейту
// Tc температура по Цельсию

var Tc = prompt("Введите число", "Например: 23");

Tf = (9 / 5) * Tc + 32;
alert(Tf);

//Урок № 1 Задание № 2

var admin;
var name;
name = "Василий";
admin = name;

console.log(admin);

//Урок № 1 Задание № 3

// 1000108 - связано с типизацией в JS

//Урок № 1 Задание № 4

// async - выполнение скрипта по мере загрузки в браузер (пример: счетчики, реклама)

// defer - загрузка файла-скрипта в фоновом режиме с соблюдением последовательности (дерево DOM должно быть готово) Работает только для внешних скриптов
